# Pandas가 무엇인가요?
* 팬더스 데이터 프레임, 시리즈 알아보기
* 출처: https://www.youtube.com/watch?v=pFXipjh0ghw&list=PLVNY1HnUlO26Igldy2Q6Nb2LZbpQWTyle&index=1

In [1]:
import pandas as pd

In [3]:
data_frame = pd.read_csv('data/housing.csv')

* tab을 누르면 사용할 수 있는 자동완성 리스트가 나온다.
* data_frame 은 2D array이다 excel과 상당히 유사
* pandas는 기본적으로 numpy를 사용한다. 퍼모먼스가 좋다.

In [6]:
data_frame.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

* data_frame의 각 컬럼들이 Series 이다.
* 그래서 data_frame은 Series의 결합체이다.

In [7]:
list_tmp = [1,2,3]

In [8]:
list_tmp

[1, 2, 3]

In [9]:
s1 = pd.core.series.Series([1,2,3])

In [10]:
s2 = pd.core.series.Series(['one','two','three'])

In [12]:
# series 2개로 데이터 프레임 만들기
pd.DataFrame(data=dict(num=s1,word=s2)) 
# 숫자는 s1, word는 s2
# python 리스트로 시리즈 만들고
# series로 데이터프레임을 만들었다.
# 이건 라이브러리 안에서 실행된다.

   num   word
0    1    one
1    2    two
2    3  three

In [19]:
data_frame.tail(2) #뒤에서 두개

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [ ]:
df = pd.read_csv('data/tab.csv',delimiter = '\t')
# 데이터가 탭으로 구분된 경우

In [ ]:
df = pd.read_csv('data/tab.csv',header = None)
# 데이터에 헤더가 없어요~

In [ ]:
df.columns = ['name','age','job']
# 헤더 정보를 넣어주기.

In [ ]:
df =pd.read_csv('data/no_header.csv', header= None , names =['name','age','job'])
# 한방에 넣을 수 있다.

# Create DataFrame from your python code

In [20]:
import pandas as pd

In [21]:
# dictionary를 가지고 있는 리스트 만들것이다.
friend_dict_list = [
    {'name':'John','age':25, 'job':'student'},
    {'name':'Nate','age':30, 'job':'teacher'}
]

In [22]:
df = pd.DataFrame(friend_dict_list)

In [23]:
df.head()
# 딕셔너리는 키값의 순서가 보장이 안된다.

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [24]:
df = df[['name','age','job']]
# 컬럼의 순서를 변경해야하는 번거로움

In [25]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [26]:
from collections import OrderedDict

In [27]:
#키의 순서를 보장한다.
friend_ordered_dict = OrderedDict(
    [
        ('name',['john','nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
        
    ]
)

In [28]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [29]:
df.head()

   name  age      job
0  john   25  student
1  nate   30  teacher

In [30]:
friend_list = [
    ['john',20,'student'],
    ['Nate',30,'teacher']
]

In [31]:
column_name = ['name','age','job']

In [32]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [33]:
df.head()

   name  age      job
0  john   20  student
1  Nate   30  teacher

* dictionary list로 DataFrame을 만드는것과 list를 각각의 컬럼으로 DataFrame을 만드는것은 서로 다르다

In [34]:
# 한번에 만들어 보고싶다!

In [35]:
friend_list =[
    ['name',['John','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [36]:
df = pd.DataFrame.from_items(friend_list)

In [37]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
# 이처럼 Dictionary와 list를 활용하면 DataFrame을 만들 수 있다.

# Write DataFrame to csv

In [3]:
friends = [{'name':'Jone', 'age':20,'job':'student'},
            {'name':'Jenny','age':30,'job':None},
          {'name':'Nate','age':30,'job':'teacher'}]
df = pd.DataFrame(friends)
df = df[['name','age','job']]

In [4]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

You can create csv file using below command

In [5]:
df.to_csv('friend_list_from_df.csv')
# index 는 true , header = true 다 가 default로 설정되어있다.

Below is one example of dataframe doesn't have header

In [8]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)

In [9]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

you can write csv file using below command

In [10]:
df.to_csv('friends_list_from_df.csv')

you also can write csv file using below command

In [11]:
df.to_csv('frien_list_from_df.txt')

by default, header and index are True like below, even if you don't mention itin the command

In [12]:
df.to_csv('friend_list_from_df.csv',header = True ,index =True)

header = False means you don't want to create column names. no 0, 1, 2 at column name
index = False means you don't want to create row names. no 0,1,2 at row name

In [13]:
df.to_csv('friend_list_from_df.csv',header = False , index = False)

In [15]:
friend_list = [
    ['name',['John',None,'nate']],
    ['age',[20,None,30]],
    ['job',['student','developer','teacher']]
    
]
df = pd.DataFrame.from_items(friend_list)

In [16]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [17]:
df.to_csv('friend_list_from_df.csv')

In [18]:
df.to_csv('friend_list_from_df.csv',na_rep='-')

# Select, Filter Rows or Columns

In [10]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[10,20,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

In [11]:
df

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

인덱스 1번에서 2번까지의 행을 선택

In [12]:
df[1:3] # 파이썬은 기본적으로 인덱스를 주면 첫번째는 포함하고 마지막 인덱스는 포함하지 않는다.

    name  age        job
1  Jenny   20  developer
2   Nate   30    teacher

In [13]:
df.loc[[0,2]] # location 함수 여기에 원하는 row의 index를 넣어주면 된다.

   name  age      job
0  John   10  student
2  Nate   30  teacher

In [14]:
df.head()

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

# by column condition

In [15]:
df_filtered = df[df.age > 25]

In [16]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [21]:
df_filtered = df.query('age>=20')

In [22]:
df_filtered

    name  age        job
1  Jenny   20  developer
2   Nate   30    teacher

In [23]:
df_filtered = df[(df.age >25)& (df.name == 'Nate')]

In [24]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [25]:
df

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

# Filter Column
### by index

In [29]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)
# 데이터 프레임을 리스트로 만듬
#df = pd.DataFrame.from_records(데이터, columns = column_name) 이렇게 하면 컬럼name 지정해서 df 를 만들 수 있다.
df
# 컬럼도 인덱스가 있게 만듬 , row 인덱스도 일부러

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

select all rows, from column 0 to column 1

* 만약 Column 인덱스 0번과 1번만 필요하다면 어떨까 ,

In [31]:
# iloc 모든 로우를 원한다 하면 : (콜론) 하고 , 0:2  3개의 로우 0번 1번 컬럼
# , 컴마가 있고 앞부분 과 뒷부분  앞부분 로우 뒷부분 컬럼
#  로우,컬럼
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [32]:
df.iloc[:,:]

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## by column name

In [42]:
df = pd.read_csv('data/housing.csv')
#df = pd.read_csv('data/housing.csv',header= None , names = ['longitude','latitude'] )
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [44]:
df_filtered = df[['longitude','latitude']]
df_filtered.head()

   longitude  latitude
0    -122.23     37.88
1    -122.22     37.86
2    -122.24     37.85
3    -122.25     37.85
4    -122.25     37.85

 이렇게 필터를 했고 다른 방법으로는 ?

In [46]:
df.filter(items=['longitude','latitude']).head()

   longitude  latitude
0    -122.23     37.88
1    -122.22     37.86
2    -122.24     37.85
3    -122.25     37.85
4    -122.25     37.85

In [48]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

* Column name에 특정 키워드인것만 보고싶어

In [52]:
df.filter(like='hous', axis=1).head() # 축에서 컬럼은 항상 1

   housing_median_age  households  median_house_value
0                41.0       126.0            452600.0
1                21.0      1138.0            358500.0
2                52.0       177.0            352100.0
3                52.0       219.0            341300.0
4                52.0       259.0            342200.0

In [57]:
dfex1=df.filter(regex='s$',axis=1).head() # 정규식을 사용해서 s로 끝나는것만 확인하고 싶어
dfex1

   total_rooms  total_bedrooms  households
0        880.0           129.0       126.0
1       7099.0          1106.0      1138.0
2       1467.0           190.0       177.0
3       1274.0           235.0       219.0
4       1627.0           280.0       259.0

In [58]:
dfex1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
total_rooms       5 non-null float64
total_bedrooms    5 non-null float64
households        5 non-null float64
dtypes: float64(3)
memory usage: 200.0 bytes

# Drop rows

## by row name (index name)

In [1]:
friend_dict_list = [{'age':20, 'job':'student'},
                   {'age':30, 'job':'developer'},
                    {'age':30,'job':'teacher'}
                   ] 
type(friend_dict_list)

list

In [3]:
friend_dict_list[0]
type(friend_dict_list[0])

dict

In [6]:
df = pd.DataFrame(friend_dict_list,index = ['John','Jenny','Nate'])

In [7]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

* drop row

dropped result will be shown, but dataframe kepp the dropped row

In [8]:
df.drop(['John','Nate'])

       age        job
Jenny   30  developer

df

In [9]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

you can assign the result to dataframe to keep the dropped result like below

In [10]:
df = df.drop(['John','Nate'])

In [11]:
df

       age        job
Jenny   30  developer

## drop row in place

The dropped row will be deleted from dataframe with inplace keyword parameter

In [21]:
friend_dict_list =[{'age':20,'job':'student'},
                  {'age':30,'job':'developer'},
                   {'age':30 ,'job':'teacher'}
                  ]
df = pd.DataFrame(friend_dict_list,index = ['John','Jenny','Nate'])

In [22]:
df.drop(['John','Nate'],inplace = True)
df

       age        job
Jenny   30  developer

you can drop rows by its index

In [23]:
friend_dict_list =[{'age':20,'job':'student'},
                  {'age':30,'job':'developer'},
                   {'age':30 ,'job':'teacher'}
                  ]
df = pd.DataFrame(friend_dict_list)

In [14]:
df = df.drop(df.index[[0,2]])

In [15]:
df

   age        job
1   30  developer

## by Column value

In [18]:
friend_dict_list = [{'name':'Jone','age':20,'job':'student'},
                   {'name':'Jenny', 'age':30,'job':'developer'},
                    {'name':'Nate','age':30,'job':'teacher'}
                   ]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [25]:
df = df[df.age != 30]

In [26]:
df

   age      job
0   20  student

In [27]:
friend_dict_list = [{'name':'Jone','age':20,'job':'student'},
                   {'name':'Jenny', 'age':30,'job':'developer'},
                    {'name':'Nate','age':30,'job':'teacher'}
                   ]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

In [28]:
df = df.drop('age', axis = 1) # axis =1 은 컬럼중에서 라는 뜻이다 컬럼중에서 age를 없애라

In [29]:
df

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

# Add Column / Update Column

In [5]:
friend_dict_list = [ {'name':'John','age':10,'job':'student'},
                   {'name':'Jenny','age':20,'job':'developer'},
                   {'name':'Nate','age':30,'job':'teacher'}
                    ]
df = pd.DataFrame(friend_dict_list,columns = ['name','age','job'])
df

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

## Add new Column with default value

In [6]:
df['salary'] = 0
# salary 열 삽입하기.

In [7]:
df

    name  age        job  salary
0   John   10    student       0
1  Jenny   20  developer       0
2   Nate   30    teacher       0

## Add new Column derived from existing value

In [8]:
friend_dict_list = [ {'name':'John','age':10,'job':'student'}, 
                    {'name':'Jenny','age':20,'job':'developer'},
                    {'name':'Nate','age':30,'job':'teacher'}
                   ] 
df = pd.DataFrame(friend_dict_list , columns = ['name','age','job'])
df

    name  age        job
0   John   10    student
1  Jenny   20  developer
2   Nate   30    teacher

## one linear adding column by true or false condition

In [10]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes','no')
# 학생이 아닌 사람은 연봉이 없고 아닌건 있다라고 표현하고 싶다.

In [11]:
df

    name  age        job salary
0   John   10    student     no
1  Jenny   20  developer    yes
2   Nate   30    teacher    yes

In [14]:
friend_dict_list = [{'name':'John','midterm':95,'final':85},
                    {'name':'Jenny','midterm':85,'final':80}, 
                    {'name':'Nate','midterm':10,'final':30}
                   ]
df = pd.DataFrame(friend_dict_list, columns =['name','midterm','final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [27]:
def data_init():
    friend_dict_list = [{'name':'Ao','midterm':100,'final':85},
                        {'name':'Bo','midterm':90, 'final':70},
                        {'name':'Co','midterm':80, 'final':50},
                        {'name':'Do','midterm':70, 'final':40}
                       ]
    df_init = pd.DataFrame(friend_dict_list,columns=['name','midterm','final'])
    return df_init

  name  midterm  final
0   Ao      100     85
1   Bo       90     70
2   Co       80     50
3   Do       70     40

## Column derived from adding two existing columns

In [31]:
df['total'] = df['midterm']+df['final']

In [32]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

## Column from existing column

In [33]:
df['average'] = df['total']/2
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

## Column by conditional condition

In [35]:
grades =[]
type(grades)

list

In [36]:
# 모든 로우에 대해서 값을 확인한다.
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('D')

df['grade'] = grades

In [37]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     D

## How to use apply function

* apply function helps you code concisely. the function will be applied to selected column(s) on all rows

In [38]:
def pass_or_fail(row):
    print(row)
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [39]:
df.grade = df.grade.apply(pass_or_fail)
#각 row마다 함수의 인자로 넣어줘서 return value를 df.grade에 넣어주겠다.

A
B
D

In [40]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Pass

## info Extraction using df.apply

In [3]:
date_list = [{'yyyy-mm-dd':'2000-06-27'},
             {'yyyy-mm-dd':'2002-09-04'},
             {'yyyy-mm-dd':'2007-12-31'}
            ]
df = pd.DataFrame(date_list,columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-04
2  2007-12-31

In [5]:
def extract_year(row):
    return row.split('-')[0]
# split은 열이 안만들어지넹..

In [8]:
#각 row의 'yyyy-mm-dd' 컬럼값을 extract_year 함수에 적용하겠다.
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-04  2002
2  2007-12-31  2007

In [51]:
df2 = pd.DataFrame([['Ben',50,20]],columns=['name','midterm','final'])
df2

  name  midterm  final
0  Ben       50     20

In [52]:
df.append(df2,ignore_index=True)

   final  midterm name  year  yyyy-mm-dd
0    NaN      NaN  NaN  2000  2000-06-27
1    NaN      NaN  NaN  2002  2002-09-04
2    NaN      NaN  NaN  2007  2007-12-31
3   20.0     50.0  Ben   NaN         NaN

## Apply 함수에 파라미터 전달하기

키워드 파라미터를 사용하면, apply가 적용된 함수에 파라미터를 전달할 수 있습니다.

In [10]:
def extract_year(year,current_year):
    return current_year - int(year)

In [11]:
df['age'] = df['year'].apply(extract_year,current_year=2018)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-04  2002   16
2  2007-12-31  2007   11

## apply 함수에 한 개 이상의 파라미터 전달하기

키워드 파라미터를 추가해주시면, 원하시는만큼의 파라미터를 함수에 전달 가능하다.

In [13]:
def get_introduce2(row):
    return "I was born in "+str(row.year)+"my age is "+str(row.age)

df['introduce'] = df.apply(get_introduce2,axis=1)
#df.introduce 는 warning이 뜬다.

In [14]:
df

   yyyy-mm-dd  year  age                       introduce
0  2000-06-27  2000   18  I was born in 2000my age is 18
1  2002-09-04  2002   16  I was born in 2002my age is 16
2  2007-12-31  2007   11  I was born in 2007my age is 11

## Map함수로 컬럼추가 및 변경

파라미터로 함수를 전달하면 apply 함수와 동일하게 컬럼값을 추가 및 변경할 수 있다.

In [15]:
def extract_year(row):
    return row.split('-')[0]

date_list = [
    {'yyyy-mm-dd':'2000-06-27'},
    {'yyyy-mm-dd':'2005-09-27'},
    {'yyyy-mm-dd':'2010-12-31'}
]
df = pd.DataFrame(date_list,columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2005-09-27
2  2010-12-31

In [16]:
#파라미터로 함수를 전달하면 apply함수와 동일하게 컬럼값을 추가 및 변경할 수 있다.
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2005-09-27  2005
2  2010-12-31  2010

파라미터로 Dictionary를 전달하면 컬럼값을 쉽게 원하는 값으로 변경 가능하다.

기존의 컬럼값은 Dictionary의 key로 사용되고, 해당되는 value값으로 컬럼값이 변경된다.

In [19]:
job_list = [
    {'age':20 , 'job':'student'},
    {'age':30 , 'job':'developer'},
    {'age':40 , 'job':'teacher'}    
]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   40    teacher

In [20]:
df['job'] = df['job'].map({'student':1,'developer':2,'teacher':3})
df

   age  job
0   20    1
1   30    2
2   40    3

## Applymap

데이터프레임 전체 각각의 값을 한 번에 변경시킬 때 사용

In [21]:
x_y = [
    {'x':5.5,'y':-5.6},
    {'x':-5.5,'y':5.6},
    {'x':1.5,'y':-4.6},
    {'x':3.5,'y':-2.6}
]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.5  5.6
2  1.5 -4.6
3  3.5 -2.6

In [23]:
import numpy as np

In [25]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -6.0  6.0
2  2.0 -5.0
3  4.0 -3.0

## 데이터프레임에 로우 추가하기
* 데이터를 크롤링했을때 DataFrame에 append해서 추가할 수 있다.

In [26]:
# 가끔 크롤링할때 데이터를 추가할 수 있다.
friend_dict_list = [
    {'name':'John','midterm':95, 'final':85},
    {'name':'Jenny','midterm':85, 'final':95},
    {'name':'Nate','midterm':66, 'final':75},
    {'name':'Bob','midterm':55, 'final':65}
]
df = pd.DataFrame(friend_dict_list, columns = ['name','midterm','final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     95
2   Nate       66     75
3    Bob       55     65

In [27]:
df2 = pd.DataFrame([['Ben',50,50],['Ant',20,20]],columns=['name','midterm','final'])
df2

  name  midterm  final
0  Ben       50     50
1  Ant       20     20

In [28]:
df.append(df2,ignore_index = True)

    name  midterm  final
0   John       95     85
1  Jenny       85     95
2   Nate       66     75
3    Bob       55     65
4    Ben       50     50
5    Ant       20     20

## Group by

데이터에서 정보를 취하기 위해 그룹별로 묶는 방법에 대해 알아보자.

In [29]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [30]:
groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [31]:
groupby_major.head

In [34]:
df.groupby('major').groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [41]:
for name, group in groupby_major:
    print(name + ": "+ str(len(group)))
    print(group)
    print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [44]:
df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index()

In [45]:
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [46]:
groupby_sex = df.groupby('sex')

In [47]:
for name, group in groupby_sex:
    print(name+": "+str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [50]:
df_sex_cnt = pd.DataFrame({'count':groupby_sex.size()}).reset_index()

In [51]:
df_sex_cnt

      sex  count
0  female      6
1    male      5

## 중복데이터 드롭하기

In [52]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

## 중복데이터 확인하기

In [53]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [54]:
df = df.drop_duplicates()

In [55]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [56]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [58]:
df.duplicated(['name','major']) ## 이렇게 두개로도 연결이 가능하네.

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

* keep 옵션값을 줘서 first,last 를 주면 중복된 값 중 어느값을 살릴지 결정할 수 있다. 기본 first

In [60]:
df.drop_duplicates(['name'],keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [61]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [62]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

Null 또는 NaN 확인하기

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [64]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [65]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [66]:
df.isnull().sum()

name    0
job     0
age     2
dtype: int64

null 또는 Nan변경하기

In [67]:
tmp = df
tmp['age'] = tmp['age'].fillna(0)
tmp

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

0보단 값을 가공해주는게 더 좋아보인다.

In [68]:
df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace = True)

In [69]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

## Unique

컬럼에 여러 값이 있을 때, 중복 없이 어떤 값들이 있는 지 확인하는 방법입니다.

In [70]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

컬럼(시리즈)의 Unique() 함수를 사용해 중복없이 컬럼에 있는 모든 값을 출력

In [71]:
print(df.job.unique())

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

각 유니크한 값별로 몇 개의 데이터가 속하는지 value_counts()한다.

In [72]:
df.job.value_counts()

teacher              8
student              5
lawyer               2
banker               2
dentist              1
basketball player    1
developer            1
Name: job, dtype: int64

In [1]:
#